pieceofApple/Low-power-digital-clock-1uA-/msp430g2553低功耗数字钟完全版.c
    adc_renew();
    init_LPM_clock();
    init_timer();
    init_LPM_IO();
    time_renew(show, clock_time);
    //adc_init(); // 初始化ADC
    __bis_SR_register(GIE);
    //adc_value = adc_read(); // 读取ADC通道0的电压值
    //AD = adc_value / 158.0;//143.o
    while (1) {
        if (sign_adc_flag1 == 0) {   //显示电压
            adc_renew();
            led_show(adc_show);
            continue;
        }
        if (sign_setup_change == 0) {   //普通界面
            if (sign_5s_flag == 1)
                led_show(show);
            else {
                sign_point2 = 1;
                sign_point4 = 1;
                sign_point5 = 0;
                time_renew(show, clock_time);
                led_show(show);
            }
        }
        else if (sign_setup_change == 1) {   //设置时间界面
            if (sign_setup_class == 1) {
                time_renew(show, clock_time);
                led_show(show);
            }
            else if (sign_setup_class == 2) {
                date_renew(show, clock_date);
                led_show(show);
            }
            else if (sign_setup_class == 3) {
                year_renew(show, clock_year);
                led_show(show);
            }
            else if (sign_setup_class == 0) {
                //time_renew(show, clock_time);
                led_show(show);
                //sign_setup_class = 1;
            }
        }
        else if (sign_setup_change == 2) {  //进入闹钟显示界面
            alarm_renew(show, clock_alarm);
            led_show(show);
        }
        else if (sign_setup_change == 3) {  //进入设置闹钟的界面
            alarm_renew(show, clock_alarm);
            led_show(show);
        }
    }
}

#pragma vector = TIMER0_A0_VECTOR//TA0CCR0中断服务函数
__interrupt void TIMER0_A0_ISR(void) {
    //typec检测：P1.6口高电平，type——C插入
    TA0CCTL0 &= ~CCIFG;

    halfs++;
    if (halfs == 16) {
        halfs = 0;
        second0++;
        if (sign_5s_flag == 1)
            sign_5s_count++;
        if (sign_5s_count == 5) {
            sign_5s_flag = 0;
            sign_5s_count = 0;
        }
        calculate();
        if (sign_adc_flag1 == 0) {
            sign_adc_count++;
            if (sign_adc_count == 3) {
                sign_adc_count = 0;
                sign_adc_flag1 = 1;
            }
        }
        /*
        if (switch_3s_flag == 1)
            switch_3s_count++;
        if (switch_3s_count == 3) {
            switch_3s_flag = 0;
            switch_3s_count = 0;
            typec_flag = 1;
            init_LPM_clock();
            init_timer();
            init_LPM_IO();
            __bis_SR_register(LPM3_bits + GIE); // 进入LPM3模式

        }*/
    }
    //Beep
    if (minute0 == 0 && second0 == 0 && halfs == 0) {
        P1DIR |= BIT7;
        P1REN &= ~BIT7;
        timer1_init();
    }
    if (minute0 == 0 && second0 == 0 && halfs == 6) {
        P1DIR &= ~BIT7;
        TA1CCTL0 &= ~CCIE;
    }
    if (minute0 == 0 && second0 == 1 && halfs == 0) {
        P1DIR |= BIT7;
        P1REN &= ~BIT7;
        timer1_init();
    }
    if (minute0 == 0 && second0 == 1 && halfs == 6) {
        P1DIR &= ~BIT7;
        P1REN |= BIT7;
        P1OUT |= BIT7;
        TA1CCTL0 &= ~CCIE;
    }
    //
    if ((sign_setup_change == 1) || (sign_setup_change == 3))
        sign_setup_flash++;
    if (sign_setup_flash == 1000)
        sign_setup_flash = 0;


    if ((P1IN & BIT6) && (typec_flag == 1)) {
        typec_flag = 0;
        init_IO();
        init_button();
        init_clock_timer_highpower();
        sign_adc_flag1 = 0;
        sign_adc_count = 0;
        InitADC();
        AD_process();
        sign_adc_flag1 = 0;
        __bic_SR_register_on_exit(LPM3_bits); // 清除低功耗模式 3（LPM3）位
    }
    //typec检测：P1.6口低电平，type——C拔出
    if ((P1IN == 0xBF) && (typec_flag == 0)) {
        typec_flag = 1;
        init_LPM_clock();
        init_timer();
        init_LPM_IO();
        P2IE &= ~(BIT0 + BIT1 + BIT2 + BIT3 + BIT4);
        //ADC10CTL0 &= ~REFON;
        ADC10CTL0 = 0;
        ADC10CTL1 = 0;

        __bis_SR_register(LPM3_bits + GIE); // 进入LPM3模式

    }
}
#pragma vector = TIMER1_A0_VECTOR // 定时器1中断向量
__interrupt void timer1_isr(void) {
    P1OUT ^= BIT7;
}

#pragma vector=PORT2_VECTOR// 外部中断服务程序
__interrupt void Switch_Interrupt(void) {
    //__delay_cycles(900); // 延时一段时间以消除按键抖动
    //switch_3s_flag = 1;
    if (!(P2IN & BIT2)) { // 判断“下”按键是否按下,显示日期
        if (sign_setup_change == 0) { //位于普通功能，主界面转换
            sign_point4 = 1;
            sign_point2 = 0;
            sign_point5 = 0;
            sign_5s_flag = 1;
            sign_5s_count = 0;
            date_renew(show, clock_date);
        }
        else if (sign_setup_change == 1) { //在设置时间，日期，年份的界面
            //功能：对应位减1
            minus(sign_setup_class, sign_setup_wei);
            calculate();
        }
        else if (sign_setup_change == 2) { //显示闹钟的界面
            //无效按键
        }
        else if (sign_setup_change == 3) { //设置闹钟
            //功能:闹钟减1
            minus(10, sign_setup_wei);
            calculate();
        }
    }
    if (!(P2IN & BIT1)) { // 判断“中”按键是否按下,显示时间
        sign_setup_change++;
        if (sign_setup_change == 4)
            sign_setup_change = 0;
        /*sign_point2 = 1;
        sign_point4 = 1;
        sign_point5 = 0;
        time_renew(show, clock_time);*/
    }
    if (!(P2IN & BIT4)) { // 判断“上”按键是否按下,显示年份
        if (sign_setup_change == 0) { //位于普通功能，主界面转换
            sign_point2 = 0;
            sign_point4 = 0;
            sign_point5 = 0;
            sign_5s_flag = 1;
            sign_5s_count = 0;
            year_renew(show, clock_year);
        }
        else if (sign_setup_change == 1) { //在设置时间，日期，年份的界面
            //功能：对应位加1
            plus(sign_setup_class, sign_setup_wei);
            calculate();
        }
        else if (sign_setup_change == 2) { //显示闹钟的界面
            //无效按键
        }
        else if (sign_setup_change == 3) { //设置闹钟
            //功能:闹钟加一
            plus(10, sign_setup_wei);
            calculate();
        }
    }
    if (!(P2IN & BIT3)) { // 判断“右”按键是否按下,湿度
        if (sign_setup_change == 0) {   //位于普通功能，主界面转换
            sign_point2 = 0;
            sign_point4 = 0;
            sign_point5 = 1;
            sign_5s_flag = 1;
            sign_5s_count = 0;
            DHT11_ReadDATA();
            show[0] = 12;
            show[1] = 14;
            show[2] = 14;
            show[3] = rec_dat[0];
            show[4] = rec_dat[1];
            show[5] = rec_dat[2];
        }
        else if (sign_setup_change == 1) { //在设置时间，日期，年份的界面
            //功能:类的选择
            if (sign_setup_class == 0) {    //时间
                sign_point2 = 1;
                sign_point4 = 1;
                sign_point5 = 0;
                time_renew(show, clock_time);
            }
            else if (sign_setup_class == 1) {   //日期
                sign_point4 = 1;
                sign_point2 = 0;
                sign_point5 = 0;
                date_renew(show, clock_date);
            }
            else if (sign_setup_class == 2) {   //年份
                sign_point2 = 0;
                sign_point4 = 0;
                sign_point5 = 0;
                year_renew(show, clock_year);
            }
            sign_setup_class++;
            if (sign_setup_class == 3)
                sign_setup_class = 0;
        }
        else if (sign_setup_change == 2) { //显示闹钟的界面
            //无效按键
        }
        else if (sign_setup_change == 3) { //设置闹钟
            //功能：无效按键
        }
    }
    if (!(P2IN & BIT0)) { // 判断“左”按键是否按下,温度
        if (sign_setup_change == 0) {   //位于普通功能，主界面转换
            sign_point2 = 0;
            sign_point4 = 0;
            sign_point5 = 1;
            sign_5s_flag = 1;
            sign_5s_count = 0;
            DHT11_ReadDATA();
            show[0] = 11;
            show[1] = 14;
            show[2] = 14;
            show[3] = rec_dat[5];
            show[4] = rec_dat[6];
            show[5] = rec_dat[7];
        }
        else if (sign_setup_change == 1) { //在设置时间，日期，年份的界面
            //功能:位的选择
            sign_setup_wei++;
            if (sign_setup_wei == 7)
                sign_setup_wei = 0;
        }
        else if (sign_setup_change == 2) { //显示闹钟的界面
            //无效按键
        }
        else if (sign_setup_change == 3) { //设置闹钟
            //功能：选择具体的位数
            sign_setup_wei++;
            if (sign_setup_wei == 7)
                sign_setup_wei = 0;
        }
    }
    //if ((P2IN & BIT4) || (P2IN & BIT3) || (P2IN & BIT2) || (P2IN & BIT1) || (P2IN & BIT0))
    P2IFG &= ~(BIT0 + BIT1 + BIT2 + BIT3 + BIT4); // 清除中断标志

}




